app/views/tours/index.html.erb

SELECT "categories".* FROM "categories"
---
<ul>
  <% Category.all.each do |category| %>