app/controllers/tours_controller.rb

  def index
    @tours =  if params[:category_id]
                Category.find(params[:category_id]).tours
              else
                Tour.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tours".* FROM "tours" INNER JOIN "tour_categories" ON "tours"."id" = "tour_categories"."tour_id" WHERE "tour_categories"."category_id" = 1
SELECT "tours".* FROM "tours"